In [2]:
import pandas as pd

In [3]:
!ls

 600px-Schema_CBC.svg.png	   DES.ipynb
 600px-Schema_cfb.png		   Groupe_16_projet1_crypto.ipynb
 600px-Schema_ctr.png		  'Groupe18_Djibril_BA&Aicha_Niang.ipynb'
 600px-Schema_ecb.png		  'hamming (2).ipynb'
 600px-Schema_ofb.png		   hamming.py
'antilog and log suite.ipynb'	   Protocole_Echange_cle_diffie_hellman.ipynb
 BIG_DATA_TDSI.ipynb		   python.png
'Calcul Formel.ipynb'		  'Signature Numérique DSA.ipynb'
 Calcul_Formel.ipynb		   Statistique.ipynb
 Codage_fichier_source.txt.ipynb   TD_MASTER_TDSI.ipynb
'Code correcteur.ipynb'		   text.txt
'Courbes Elliptiques .ipynb'	   titanic.csv
 cours1-python-l3tdsi.ipynb	  'TP 1_DJIBRIL_BA_L3TDSI.ipynb'
 cours2-python-l3tdsi.ipynb

In [4]:
pd.__version__

'0.25.1'

## Lecture de la base

In [5]:
data = pd.read_csv("titanic.csv",sep="\t")

### Determiner la dimension

In [6]:
data.shape

(156, 12)

## Afficher les 5 premieres lignes

In [7]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Afficher les 5 dernieres lignes

In [8]:
data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

## Afficher les colonnes de la base

In [9]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

## Afficher les types des colonnes qui sont dans la base

In [10]:
data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

### Information de la base : les colonnes non nulles

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156 entries, 0 to 155
Data columns (total 12 columns):
PassengerId    156 non-null int64
Survived       156 non-null int64
Pclass         156 non-null int64
Name           156 non-null object
Sex            156 non-null object
Age            126 non-null float64
SibSp          156 non-null int64
Parch          156 non-null int64
Ticket         156 non-null object
Fare           156 non-null float64
Cabin          31 non-null object
Embarked       155 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 14.8+ KB

## Afficher les 5 dernieres lignes de la colonnes Sex

In [12]:
data['Sex'].tail()

151    female
152      male
153      male
154      male
155      male
Name: Sex, dtype: object

## Afficher les 5 premieres lignes des colonnes Age et Survived

In [13]:
data[["Age","Survived"]].head()

    Age  Survived
0  22.0         0
1  38.0         1
2  26.0         1
3  35.0         1
4  35.0         0

## Afficher la moyenne des ages

In [14]:
data.Age.mean()

28.141507936507935

In [15]:
data.Age[2:10]

2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [16]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

## Suppression des colonnes

In [17]:
data_bis = data.drop(["Ticket", "Cabin", "Embarked", "Name", "PassengerId"], axis=1)
data_bis

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0           0       3    male  22.0      1      0   7.2500
1           1       1  female  38.0      1      0  71.2833
2           1       3  female  26.0      0      0   7.9250
3           1       1  female  35.0      1      0  53.1000
4           0       3    male  35.0      0      0   8.0500
..        ...     ...     ...   ...    ...    ...      ...
151         1       1  female  22.0      1      0  66.6000
152         0       3    male  55.5      0      0   8.0500
153         0       3    male  40.5      0      2  14.5000
154         0       3    male   NaN      0      0   7.3125
155         0       1    male  51.0      0      1  61.3792

[156 rows x 7 columns]

In [18]:
data_bis["Age"][3]

35.0

+ pour modifier on part dans la base de données et modifier

### Afficher les personnes de sex female

In [19]:
data_bis[(data_bis["Sex"] == "female") & (data_bis["Age"] <= 14) ]

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare
9           1       2  female  14.0      1      0  30.0708
10          1       3  female   4.0      1      1  16.7000
14          0       3  female  14.0      0      0   7.8542
24          0       3  female   8.0      3      1  21.0750
39          1       3  female  14.0      1      0  11.2417
43          1       2  female   3.0      1      2  41.5792
58          1       2  female   5.0      1      2  27.7500
119         0       3  female   2.0      4      2  31.2750
147         0       3  female   9.0      2      2  34.3750

### Selection des gens de la colonne sex et comme valeur female

In [20]:
data_bis["Sex"][(data_bis["Sex"] == "female") & (data_bis["Age"] <= 14)]

9      female
10     female
14     female
24     female
39     female
43     female
58     female
119    female
147    female
Name: Sex, dtype: object

### Importation de matplotlib

In [21]:
import matplotlib.pyplot as plt